package mbti;

public class WithTheBestFemaleStar {
    String info;
    public WithTheBestFemaleStar() {}

    public String[][] getCelebritiesByInfo(String info) {
        switch (info) {
            case "ISTJ":
                return new String[][] {
                        {"김태리", "32", "배우"},
                        {"한소희", "28", "배우"},
                        {"이유비", "32", "배우"},
                        {"서현", "32", "가수, 배우"},
                        {"정은지", "30", "가수, 배우"},
                        {"지수", "28", "가수, 배우"},
                        {"아이유", "30", "가수, 배우"},
                        {"김지원", "30", "배우"},
                        {"한지민", "41", "배우"},
                        {"이다희", "37", "배우"},
                        {"강한나", "34", "배우"},
                        {"김유정", "23", "배우"},
                        {"신세경", "32", "배우"},
                        {"김연아", "33", "피겨스케이터"},
                        {"윤아", "31", "가수, 배우"},
                        {"전소민", "35", "배우"},
                        {"정소민", "33", "배우"},
                        {"수민", "22", "가수 (STAYC)"},
                        {"아현", "20", "가수 (BABYMONSTER)"}
                };
            case "ISFJ":
                return new String[][] {
                        {"박보영", "33", "배우"},
                        {"김지원", "30", "배우"},
                        {"아이유", "30", "가수, 배우"},
                        {"손예진", "39", "배우"},
                        {"한지민", "41", "배우"},
                        {"김태희", "41", "배우"},
                        {"서현진", "37", "배우"},
                        {"박신혜", "32", "배우"},
                        {"정소민", "33", "배우"},
                        {"송혜교", "40", "배우"},
                        {"한가인", "40", "배우"},
                        {"신세경", "32", "배우"},
                        {"윤아", "31", "가수, 배우"},
                        {"유리", "32", "가수, 배우"},
                        {"이유리", "42", "배우"},
                        {"나코", "21", "가수 (IZ*ONE)"},
                        {"은하", "25", "가수 (GFRIEND)"},
                        {"루다", "24", "가수 (WJSN)"}
                };
            case "ESTJ":
                return new String[][] {
                        {"김태희", "41", "배우"},
                        {"서현진", "37", "배우"},
                        {"김소연", "41", "배우"},
                        {"정유미", "37", "배우"},
                        {"이영은", "40", "배우"},
                        {"전소민", "35", "배우"},
                        {"박보영", "33", "배우"},
                        {"김지원", "30", "배우"},
                        {"한소희", "28", "배우"},
                        {"이나영", "43", "배우"},
                        {"이지아", "43", "배우"},
                        {"이다희", "37", "배우"},
                        {"윤아", "31", "가수, 배우"},
                        {"신세경", "32", "배우"},
                        {"한지민", "41", "배우"},
                        {"김도연", "22", "가수 (Weki Meki)"},
                        {"이진솔", "24", "가수 (April)"},
                        {"수정", "24", "가수 (LOVELYZ)"}
                };
            case "ESFJ":
                return new String[][] {
                        {"유인나", "40", "배우"},
                        {"장나라", "41", "배우"},
                        {"윤아", "31", "가수, 배우"},
                        {"손예진", "39", "배우"},
                        {"김혜수", "52", "배우"},
                        {"송윤아", "47", "배우"},
                        {"이보영", "41", "배우"},
                        {"박보영", "33", "배우"},
                        {"김지원", "30", "배우"},
                        {"이나영", "43", "배우"},
                        {"김태희", "41", "배우"},
                        {"한소희", "28", "배우"},
                        {"김유정", "23", "배우"},
                        {"신세경", "32", "배우"},
                        {"한가인", "40", "배우"},
                        {"주이", "21", "가수 (MOMOLAND)"},
                        {"리나", "22", "가수 (H1-KEY)"},
                        {"수현", "23", "가수 (Billlie)"}
                };
            case "INFJ":
                return new String[][] {
                        {"김고은", "30", "배우"},
                        {"정유미", "38", "배우"},
                        {"배두나", "42", "배우"},
                        {"김지원", "30", "배우"},
                        {"신세경", "32", "배우"},
                        {"한소희", "28", "배우"},
                        {"이다희", "37", "배우"},
                        {"김연아", "33", "피겨스케이터"},
                        {"윤아", "31", "가수, 배우"},
                        {"박보영", "33", "배우"},
                        {"이나영", "43", "배우"},
                        {"김태리", "32", "배우"},
                        {"한지민", "41", "배우"},
                        {"이유비", "32", "배우"},
                        {"정은지", "30", "가수, 배우"},
                        {"원영", "18", "가수 (IVE)"},
                        {"채령", "21", "가수 (ITZY)"},
                        {"카리나", "21", "가수 (aespa)"}
                };
            case "INFP":
                return new String[][] {
                        {"수지", "28", "가수, 배우"},
                        {"박신혜", "32", "배우"},
                        {"설리", "27", "배우"},
                        {"전소민", "35", "배우"},
                        {"정은지", "30", "가수, 배우"},
                        {"이성경", "31", "배우"},
                        {"박소담", "30", "배우"},
                        {"김연아", "33", "피겨스케이터"},
                        {"정소민", "33", "배우"},
                        {"아이유", "30", "가수, 배우"},
                        {"김유정", "23", "배우"},
                        {"윤아", "31", "가수, 배우"},
                        {"서현", "32", "가수, 배우"},
                        {"한지민", "41", "배우"},
                        {"김고은", "30", "배우"},
                        {"조유리", "21", "가수 (IZ*ONE)"},
                        {"사나", "25", "가수 (TWICE)"},
                        {"지원", "21", "가수 (fromis_9)"}
                };
            case "ENFJ":
                return new String[][] {
                        {"김유정", "23", "배우"},
                        {"신예은", "23", "배우"},
                        {"연우", "25", "가수, 배우 (MOMOLAND)"},
                        {"유정", "25", "가수 (Weki Meki)"},
                        {"미연", "25", "가수 ((G)I-DLE)"},
                        {"하니", "27", "가수, 배우 (EXID)"},
                        {"정은지", "30", "가수 (Apink)"},
                        {"수현", "25", "가수 (AKMU)"},
                        {"승희", "24", "가수 (OH MY GIRL)"},
                        {"유주", "24", "가수 (GFRIEND)"},
                        {"고은", "26", "배우"},
                        {"김소현", "24", "배우"},
                        {"민주", "20", "가수 (IZ*ONE)"},
                        {"지원", "21", "가수 (fromis_9)"},
                        {"다영", "23", "가수 (WJSN)"}
                };
            case "ENFP":
                return new String[][] {
                        {"안유진", "20", "가수 (IVE)"},
                        {"사나", "25", "가수 (TWICE)"},
                        {"조유리", "21", "가수 (IZ*ONE)"},
                        {"아린", "23", "가수 (OH MY GIRL)"},
                        {"아이린", "22", "가수 (Red Velvet)"},
                        {"채원", "21", "가수 (LE SSERAFIM)"},
                        {"설아", "26", "가수 (WJSN)"},
                        {"지호", "24", "가수 (OH MY GIRL)"},
                        {"김세정", "24", "가수, 배우 (gugudan)"},
                        {"유빈", "24", "가수 (Weki Meki)"},
                        {"보나", "26", "가수, 배우 (WJSN)"},
                        {"유현", "25", "가수 (Dreamcatcher)"},
                        {"채영", "22", "가수 (TWICE)"},
                        {"고은", "26", "가수 (P.O.P)"},
                        {"정채연", "24", "가수, 배우 (DIA)"}
                };
            case "INTJ":
                return new String[][] {
                        {"웬디", "27", "가수 (Red Velvet)"},
                        {"루시", "22", "가수 (Weki Meki)"},
                        {"지애", "25", "가수 (LOVELYZ)"},
                        {"지유", "24", "가수 (Dreamcatcher)"},
                        {"채원", "24", "가수 (LE SSERAFIM)"},
                        {"지원", "21", "가수 (fromis_9)"},
                        {"가은", "23", "가수 (PRISTIN)"},
                        {"서연", "25", "가수 (DREAMCATCHER)"},
                        {"민지", "20", "가수 (NewJeans)"},
                        {"유현", "25", "가수 (Dreamcatcher)"},
                        {"혜인", "21", "가수 (NewJeans)"},
                        {"유아", "25", "가수 (OH MY GIRL)"},
                        {"설아", "26", "가수 (WJSN)"},
                        {"수정", "24", "가수 (LOVELYZ)"},
                        {"보나", "26", "가수 (WJSN)"}
                };
            case "INTP":
                return new String[][] {
                        {"제니", "27", "가수 (BLACKPINK)"},
                        {"리사", "27", "가수 (BLACKPINK)"},
                        {"지수", "27", "가수 (BLACKPINK)"},
                        {"미나", "25", "가수 (TWICE)"},
                        {"은하", "25", "가수 (GFRIEND)"},
                        {"신비", "23", "가수 (GFRIEND)"},
                        {"이새롬", "26", "가수 (fromis_9)"},
                        {"이나경", "24", "가수 (fromis_9)"},
                        {"김소현", "24", "배우"},
                        {"김지수", "27", "배우"},
                        {"정은채", "34", "배우"},
                        {"전소미", "21", "가수 (I.O.I)"},
                        {"로제", "26", "가수 (BLACKPINK)"},
                        {"유리", "24", "가수 (IZ*ONE)"},
                        {"나코", "21", "가수 (IZ*ONE)"}
                };
            case "ENTJ":
                return new String[][] {
                        {"슬기", "28", "가수 (Red Velvet)"},
                        {"지수", "27", "가수 (BLACKPINK)"},
                        {"소연", "24", "가수 ((G)I-DLE)"},
                        {"유라", "30", "배우"},
                        {"유주", "24", "가수 (GFRIEND)"},
                        {"채영", "22", "가수 (TWICE)"},
                        {"수정", "24", "가수 (LOVELYZ)"},
                        {"지애", "25", "가수 (LOVELYZ)"},
                        {"소유", "31", "가수 (SISTAR)"},
                        {"보나", "26", "가수 (WJSN)"},
                        {"미나", "24", "가수 (gugudan)"},
                        {"김세정", "24", "가수 (gugudan)"},
                        {"연정", "21", "가수 (WJSN)"},
                        {"정연", "24", "가수 (TWICE)"},
                        {"리나", "23", "가수 (Weki Meki)"}
                };
            case "ENTP":
                return new String[][] {
                        {"제니", "27", "가수 (BLACKPINK)"},
                        {"조이", "25", "가수 (Red Velvet)"},
                        {"선미", "29", "가수 (Wonder Girls)"},
                        {"정채연", "24", "가수 (DIA)"},
                        {"유정", "25", "가수 (Weki Meki)"},
                        {"채영", "22", "가수 (TWICE)"},
                        {"루시", "22", "가수 (Weki Meki)"},
                        {"이채영", "24", "가수 (fromis_9)"},
                        {"신비", "23", "가수 (GFRIEND)"},
                        {"가영", "24", "가수 (fromis_9)"},
                        {"지원", "21", "가수 (fromis_9)"},
                        {"조유리", "21", "가수 (IZ*ONE)"},
                        {"유리", "24", "가수 (IZ*ONE)"},
                        {"민지", "20", "가수 (NewJeans)"},
                        {"채령", "21", "가수 (ITZY)"}
                };
            case "ISTP":
                return new String[][] {
                        {"은하", "25", "가수 (GFRIEND)"},
                        {"문별", "28", "가수 (MAMAMOO)"},
                        {"유라", "30", "가수, 배우 (Girl's Day)"},
                        {"정연", "24", "가수 (TWICE)"},
                        {"유진", "20", "가수 (IVE)"},
                        {"지원", "21", "가수 (fromis_9)"},
                        {"가영", "24", "가수 (fromis_9)"},
                        {"소연", "24", "가수 ((G)I-DLE)"},
                        {"수정", "24", "가수 (LOVELYZ)"},
                        {"루다", "24", "가수 (WJSN)"},
                        {"김도연", "22", "가수 (Weki Meki)"},
                        {"정채연", "24", "가수 (DIA)"},
                        {"예린", "25", "가수 (GFRIEND)"},
                        {"시아", "22", "가수 (EVERGLOW)"},
                        {"유아", "25", "가수 (OH MY GIRL)"}
                };
            case "ISFP":
                return new String[][] {
                        {"지수", "27", "가수 (BLACKPINK)"},
                        {"루다", "24", "가수 (WJSN)"},
                        {"연우", "25", "가수, 배우 (MOMOLAND)"},
                        {"지효", "24", "가수 (TWICE)"},
                        {"민지", "20", "가수 (NewJeans)"},
                        {"유리", "24", "가수 (IZ*ONE)"},
                        {"서연", "25", "가수 (DREAMCATCHER)"},
                        {"윤아", "31", "가수, 배우 (SNSD)"},
                        {"시아", "22", "가수 (EVERGLOW)"},
                        {"예린", "25", "가수 (GFRIEND)"},
                        {"설아", "26", "가수 (WJSN)"},
                        {"채영", "22", "가수 (TWICE)"},
                        {"소연", "24", "가수 ((G)I-DLE)"},
                        {"지원", "21", "가수 (fromis_9)"},
                        {"수진", "23", "가수 ((G)I-DLE)"}
                };
            case "ESTP":
                return new String[][] {
                        {"화사", "26", "가수 (MAMAMOO)"},
                        {"유빈", "34", "가수, 배우 (Wonder Girls)"},
                        {"효린", "31", "가수 (SISTAR)"},
                        {"소진", "35", "가수 (Girl's Day)"},
                        {"유리", "32", "가수 (SNSD)"},
                        {"하니", "27", "가수, 배우 (EXID)"},
                        {"나연", "26", "가수 (TWICE)"},
                        {"리아", "20", "가수 (ITZY)"},
                        {"채영", "22", "가수 (TWICE)"},
                        {"은지", "20", "가수 (LE SSERAFIM)"},
                        {"유진", "20", "가수 (IVE)"},
                        {"소미", "21", "가수 (I.O.I)"},
                        {"민지", "20", "가수 (NewJeans)"},
                        {"미나", "24", "가수 (gugudan)"},
                        {"지수", "27", "가수 (BLACKPINK)"}
                };
            case "ESFP":
                return new String[][] {
                        {"아이린", "30", "가수 (Red Velvet)"},
                        {"솔라", "30", "가수 (MAMAMOO)"},
                        {"유라", "30", "가수, 배우 (Girl's Day)"},
                        {"선미", "29", "가수 (Wonder Girls)"},
                        {"지호", "24", "가수 (OH MY GIRL)"},
                        {"사나", "25", "가수 (TWICE)"},
                        {"연우", "25", "가수, 배우 (MOMOLAND)"},
                        {"주이", "21", "가수 (MOMOLAND)"},
                        {"미나", "24", "가수 (gugudan)"},
                        {"예리", "22", "가수 (Red Velvet)"},
                        {"리아", "20", "가수 (ITZY)"},
                        {"아린", "23", "가수 (OH MY GIRL)"},
                        {"유빈", "24", "가수 (Weki Meki)"},
                        {"보나", "26", "가수 (WJSN)"},
                        {"지원", "21", "가수 (fromis_9)"}
                };
            default:
                return null;

        }
    }
}
