package mbti;

public class WithTheBestStar{
// 여기에서 2차상속 조지고
    private String info;

    public WithTheBestStar() {

    }// 여기서 나의 MBTI 받았다
    public String[][] getCelebritiesByInfo(String info) {
        switch (info) {
            case "ISTJ":
                return new String[][] {
                        {"김수현", "35", "배우"},
                        {"도경수 (D.O.)", "30", "가수, 배우 (EXO)"},
                        {"이제훈", "37", "배우"},
                        {"류준열", "35", "배우"},
                        {"박보검", "30", "배우"},
                        {"서강준", "30", "배우"},
                        {"차은우", "26", "가수, 배우 (ASTRO)"},
                        {"김명수 (엘)", "31", "가수, 배우 (INFINITE)"},
                        {"임시완", "34", "가수, 배우 (ZE:A)"},
                        {"이종석", "34", "배우"},
                        {"유승호", "30", "배우"},
                        {"윤두준", "34", "가수, 배우 (Highlight)"},
                        {"김재중", "37", "가수, 배우 (JYJ)"},
                        {"정해인", "34", "배우"},
                        {"주지훈", "40", "배우"}
                };
            case "ISFJ":
                return new String[][] {
                        {"박서준", "35", "배우"},
                        {"이민호", "35", "배우"},
                        {"남주혁", "29", "배우"},
                        {"장기용", "30", "배우"},
                        {"정해인", "34", "배우"},
                        {"김영광", "36", "배우"},
                        {"이준기", "41", "배우"},
                        {"김수현", "35", "배우"},
                        {"박보검", "30", "배우"},
                        {"육성재", "27", "가수, 배우 (BTOB)"},
                        {"양요섭", "32", "가수 (Highlight)"},
                        {"윤두준", "34", "가수, 배우 (Highlight)"},
                        {"도경수 (D.O.)", "30", "가수, 배우 (EXO)"},
                        {"차은우", "26", "가수, 배우 (ASTRO)"},
                        {"김명수 (엘)", "31", "가수, 배우 (INFINITE)"}
                };
            case "ISTP":
                return new String[][] {
                        {"박형식", "31", "가수, 배우 (ZE:A)"},
                        {"강하늘", "33", "배우"},
                        {"이동욱", "41", "배우"},
                        {"이진욱", "40", "배우"},
                        {"유아인", "37", "배우"},
                        {"이제훈", "37", "배우"},
                        {"변요한", "37", "배우"},
                        {"김재욱", "38", "배우"},
                        {"최다니엘", "37", "배우"},
                        {"조인성", "41", "배우"},
                        {"정우성", "49", "배우"},
                        {"김우빈", "34", "배우"},
                        {"박서준", "35", "배우"},
                        {"윤두준", "34", "가수, 배우 (Highlight)"},
                        {"서강준", "30", "배우"}
                };
            case "ISFP":
                return new String[][] {
                        {"유아인", "37", "배우"},
                        {"김우빈", "34", "배우"},
                        {"박서준", "35", "배우"},
                        {"차은우", "26", "가수, 배우 (ASTRO)"},
                        {"도경수 (D.O.)", "30", "가수, 배우 (EXO)"},
                        {"서강준", "30", "배우"},
                        {"이준기", "41", "배우"},
                        {"이제훈", "37", "배우"},
                        {"장동윤", "30", "배우"},
                        {"이승기", "35", "가수, 배우"},
                        {"안효섭", "28", "배우"},
                        {"김재욱", "38", "배우"},
                        {"변요한", "37", "배우"},
                        {"임시완", "34", "가수, 배우 (ZE:A)"},
                        {"이종석", "34", "배우"}
                };
            case "INFJ":
                return new String[][] {
                        {"이종석", "34", "배우"},
                        {"박보검", "30", "배우"},
                        {"남주혁", "29", "배우"},
                        {"도경수 (D.O.)", "30", "가수, 배우 (EXO)"},
                        {"김수현", "35", "배우"},
                        {"서강준", "30", "배우"},
                        {"정해인", "34", "배우"},
                        {"장기용", "30", "배우"},
                        {"이제훈", "37", "배우"},
                        {"유아인", "37", "배우"},
                        {"임시완", "34", "가수, 배우 (ZE:A)"},
                        {"김우빈", "34", "배우"},
                        {"차은우", "26", "가수, 배우 (ASTRO)"},
                        {"안효섭", "28", "배우"},
                        {"이승기", "35", "가수, 배우"}
                };
            case "INFP":
                return new String[][] {
                        {"유승호", "30", "배우"},
                        {"정해인", "34", "배우"},
                        {"김명수 (엘)", "31", "가수, 배우 (INFINITE)"},
                        {"박보검", "30", "배우"},
                        {"남주혁", "29", "배우"},
                        {"도경수 (D.O.)", "30", "가수, 배우 (EXO)"},
                        {"서강준", "30", "배우"},
                        {"장동윤", "30", "배우"},
                        {"김수현", "35", "배우"},
                        {"안효섭", "28", "배우"},
                        {"이도현", "26", "배우"},
                        {"송강", "29", "배우"},
                        {"정우성", "49", "배우"},
                        {"김재욱", "38", "배우"},
                        {"변요한", "37", "배우"}
                };
            case "INTJ":
                return new String[][] {
                        {"이제훈", "37", "배우"},
                        {"김동욱", "39", "배우"},
                        {"강동원", "41", "배우"},
                        {"변요한", "37", "배우"},
                        {"이진욱", "40", "배우"},
                        {"유아인", "37", "배우"},
                        {"주지훈", "40", "배우"},
                        {"이선균", "47", "배우"},
                        {"김재욱", "38", "배우"},
                        {"최다니엘", "37", "배우"},
                        {"김명민", "50", "배우"},
                        {"송중기", "38", "배우"},
                        {"조인성", "41", "배우"},
                        {"정우성", "49", "배우"},
                        {"하정우", "45", "배우"}
                };
            case "INTP":
                return new String[][] {
                        {"유아인", "37", "배우"},
                        {"이제훈", "37", "배우"},
                        {"김동욱", "39", "배우"},
                        {"강하늘", "33", "배우"},
                        {"이진욱", "40", "배우"},
                        {"변요한", "37", "배우"},
                        {"최다니엘", "37", "배우"},
                        {"김우빈", "34", "배우"},
                        {"김명수 (엘)", "31", "가수, 배우 (INFINITE)"},
                        {"차은우", "26", "가수, 배우 (ASTRO)"},
                        {"이준기", "41", "배우"},
                        {"김재욱", "38", "배우"},
                        {"서강준", "30", "배우"},
                        {"김수현", "35", "배우"},
                        {"임시완", "34", "가수, 배우 (ZE:A)"}
                };
            case "ESFJ":
                return new String[][] {
                        {"박서준", "35", "배우"},
                        {"이준기", "41", "배우"},
                        {"남주혁", "29", "배우"},
                        {"안효섭", "28", "배우"},
                        {"김영광", "36", "배우"},
                        {"이승기", "35", "가수, 배우"},
                        {"주지훈", "40", "배우"},
                        {"차은우", "26", "가수, 배우 (ASTRO)"},
                        {"김명수 (엘)", "31", "가수, 배우 (INFINITE)"},
                        {"장기용", "30", "배우"},
                        {"김우빈", "34", "배우"},
                        {"유연석", "38", "배우"},
                        {"유승호", "30", "배우"},
                        {"정해인", "34", "배우"},
                        {"류준열", "35", "배우"}
                };
            case "ESTP":
                return new String[][] {
                        {"김수현", "35", "배우"},
                        {"서강준", "30", "배우"},
                        {"송강", "29", "배우"},
                        {"이도현", "26", "배우"},
                        {"박형식", "31", "가수, 배우 (ZE:A)"},
                        {"정해인", "34", "배우"},
                        {"유연석", "38", "배우"},
                        {"남주혁", "29", "배우"},
                        {"강하늘", "33", "배우"},
                        {"안효섭", "28", "배우"},
                        {"이승기", "35", "가수, 배우"},
                        {"주지훈", "40", "배우"},
                        {"차은우", "26", "가수, 배우 (ASTRO)"},
                        {"김우빈", "34", "배우"},
                        {"임시완", "34", "가수, 배우 (ZE:A)"}
                };
            case "ESFP":
                return new String[][] {
                        {"이민호", "35", "배우"},
                        {"박보검", "30", "배우"},
                        {"김우빈", "34", "배우"},
                        {"남주혁", "29", "배우"},
                        {"서강준", "30", "배우"},
                        {"유승호", "30", "배우"},
                        {"차은우", "26", "가수, 배우 (ASTRO)"},
                        {"안효섭", "28", "배우"},
                        {"김명수 (엘)", "31", "가수, 배우 (INFINITE)"},
                        {"이준기", "41", "배우"},
                        {"이제훈", "37", "배우"},
                        {"장기용", "30", "배우"},
                        {"송강", "29", "배우"},
                        {"류준열", "35", "배우"},
                        {"정해인", "34", "배우"}
                };
            case "ENFJ":
                return new String[][] {
                        {"김수현", "35", "배우"},
                        {"박서준", "35", "배우"},
                        {"이종석", "34", "배우"},
                        {"차은우", "26", "가수, 배우 (ASTRO)"},
                        {"김영광", "36", "배우"},
                        {"정해인", "34", "배우"},
                        {"류준열", "35", "배우"},
                        {"남주혁", "29", "배우"},
                        {"안효섭", "28", "배우"},
                        {"박형식", "31", "가수, 배우 (ZE:A)"},
                        {"김명수 (엘)", "31", "가수, 배우 (INFINITE)"},
                        {"서강준", "30", "배우"},
                        {"도경수 (D.O.)", "30", "가수, 배우 (EXO)"},
                        {"주지훈", "40", "배우"},
                        {"이제훈", "37", "배우"}
                };
            case "ENTJ":
                return new String[][] {
                        {"현빈", "41", "배우"},
                        {"주원", "34", "배우"},
                        {"이제훈", "37", "배우"},
                        {"박보검", "30", "배우"},
                        {"정해인", "34", "배우"},
                        {"이동욱", "41", "배우"},
                        {"서강준", "30", "배우"},
                        {"김재욱", "38", "배우"},
                        {"이승기", "35", "가수, 배우"},
                        {"송중기", "38", "배우"},
                        {"이민호", "35", "배우"},
                        {"김우빈", "34", "배우"},
                        {"남주혁", "29", "배우"},
                        {"차은우", "26", "가수, 배우 (ASTRO)"},
                        {"안효섭", "28", "배우"}
                };
            case "ENTP":
                return new String[][] {
                        {"유아인", "37", "배우"},
                        {"변요한", "37", "배우"},
                        {"김동욱", "39", "배우"},
                        {"김수현", "35", "배우"},
                        {"이제훈", "37", "배우"},
                        {"차은우", "26", "가수, 배우 (ASTRO)"},
                        {"김명수 (엘)", "31", "가수, 배우 (INFINITE)"},
                        {"서강준", "30", "배우"},
                        {"이진욱", "40", "배우"},
                        {"송강", "29", "배우"},
                        {"도경수 (D.O.)", "30", "가수, 배우 (EXO)"},
                        {"김재욱", "38", "배우"},
                        {"이동욱", "41", "배우"},
                        {"박형식", "31", "가수, 배우 (ZE:A)"},
                        {"김우빈", "34", "배우"}
                };
            case "ENFP":
                return new String[][] {
                        {"차은우", "26", "가수, 배우 (ASTRO)"},
                        {"김동희", "25", "배우"},
                        {"김민재", "27", "배우"},
                        {"남윤수", "27", "배우"},
                        {"송강", "29", "배우"},
                        {"김재욱", "38", "배우"},
                        {"안효섭", "28", "배우"},
                        {"김명수 (엘)", "31", "가수, 배우 (INFINITE)"},
                        {"박서준", "35", "배우"},
                        {"서강준", "30", "배우"},
                        {"남주혁", "29", "배우"},
                        {"도경수 (D.O.)", "30", "가수, 배우 (EXO)"},
                        {"박보검", "30", "배우"},
                        {"정해인", "34", "배우"},
                        {"주지훈", "40", "배우"}
                };

            default: return null;
        }
    }

}
